app/controllers/api/appointments_controller.rb

  def index
    #new array to hold created appointments
    @appointments = []

    # filter for past, future appointments
    if params[:past] == "1"
      appointments = Appointment.where("start_time < ?", Time.zone.now)
    elsif params[:past] == "0"
      appointments = Appointment.where("start_time > ?", Time.zone.now)

    #  paginated appointments
    elsif params[:page] && params[:length]
      limit = params[:length]
      offset = params[:page] - 1 * params[:length]
      appointments = Appointment.limit(limit).offset(offset)

    # return all scheduled appointments
    else
      appointments = Appointment.all
    end

    #push each appointment into the new array
    appointments.each do |ap|
---
SELECT "appointments".* FROM "appointments" WHERE (start_time > '2022-07-02 20:23:32.875795')
SELECT "appointments".* FROM "appointments" LIMIT $1 OFFSET $2  [["LIMIT", 4], ["OFFSET", 2]]
SELECT "appointments".* FROM "appointments"