app/controllers/api/doctors_controller.rb

SELECT "doctors".* FROM "doctors" WHERE 1=1
SELECT "appointments".* FROM "appointments"
---
  def index
    # returns every doctor without an appointment scheduled
    doctors = Doctor.where.not(id: Appointment.all.map(&:doctor_id))